stress.1.yml
config:
  # target: "http://localhost:3005"
  # target: "http://ec2-54-210-50-27.compute-1.amazonaws.com"
  # target: "http://ec2-52-90-53-154.compute-1.amazonaws.com:3005"
  target: "http://ec2-54-163-128-32.compute-1.amazonaws.com:8080"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Warm up the application"
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: "Ramp up to a higher load"
    - duration: 60
      arrivalRate: 5
      name: "Keep the higher load"
    - duration: 120
      arrivalRate: 5
      rampTo: 10
      name: "Ramp up to max load"
    - duration: 120
      arrivalRate: 10
      name: "Keep the max load"
    - duration: 60
      arrivalRate: 10
      rampTo: 5
      name: "Calm down the application"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'

scenarios:
    - flow:
        - loop:
            - get:
                url: "/menus/restaurant/{{$randomNumber(1, 1000)}}/menu/1"
          count: 100
        - loop:
            - get:
                url: "/menus/restaurant/{{$randomNumber(2000, 1000000)}}/menu/1"
          count: 5


# phases:
#     - duration: 60
#       arrivalRate: 10
#       rampTo: 50
#       name: "Warm up the application"
#     - duration: 60
#       arrivalRate: 20
#       rampTo: 100
#       name: "warm up again"
#     - duration: 60
#       arrivalRate: 100
#       name: "keep stable on big load"
#     - duration: 60
#       arrivalRate: 100
#       rampTo: 20
#       name: "calming down" 
#     - duration: 60
#       arrivalRate: 50
#       rampTo: 1000
#       name: "jump to max load"
#     - duration: 60
#       arrivalRate: 1000
#       name: "Sustained max load"
#     - duration: 60
#       arrivalRate: 1000
#       rampTo: 500
#       name: "Slow down"
#     - duration: 60
#       arrivalRate: 50
#       name: "Calm down"

# scenarios:
# - flow:
#   - get:
#       # url: "/menus/restaurant/1/menu2/1"
#       url: "/menus/restaurant/{{$randomNumber(1, 1000)}}/menu2/1"

    # - duration: 120
    #   arrivalRate: 1
    #   rampTo: 10
    #   name: "jump to max load"
    # - duration: 600
    #   arrivalRate: 10
    #   name: "keep at the max load"
    # - duration: 600
    #   arrivalRate: 15
    #   name: "keep at the max load"
    # - duration: 30
    #   arrivalRate: 10
    #   rampTo: 5
    #   name: "cool down to a lower load"
    # - duration: 30
    #   arrivalRate: 5
    #   rampTo: 1
    #   name: "calm down"